<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"cbbda4981c8d01dbe3e90c759ed7fbcb2cf5219ece82fe85d7d76b19837fe211","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #559 at https://github.com/cal-itp/data-infra/actions/runs/17558539066","plan_out_hash":"ae785449db46542031eb0ea4d360744e5ec760fe8ec6e34dbc61bca3ac436ef9","plan_hash":"0fa1c9a64b0b1903a4e37ab55dddc415399f5ba69f1585b1afbec21157d0e6de","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "NMOQDw==" -> (known after apply)
!~      detect_md5hash      = "NKnDEJbjtx2cEh1rvRnG+A==" -> "different hash"
!~      generation          = 1753225939210350 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/METADATA.yml"
!~      md5hash             = "NKnDEJbjtx2cEh1rvRnG+A==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/lhZ8A==" -> (known after apply)
!~      detect_md5hash      = "Ldqj/5mBVwijSkkKdWqAuA==" -> "different hash"
!~      generation          = 1756506125600475 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      md5hash             = "Ldqj/5mBVwijSkkKdWqAuA==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #559](https://github.com/cal-itp/data-infra/actions/runs/17558539066)